Documents/абс_ПланСкладскогоОстатка/абс_ПланСкладскогоОстатка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ПланСкладскогоОстатка</name>
  <registerRecords>InformationRegister.абс_ПрогнозСкладскогоОстатка</registerRecords>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СценарийПрогноза18</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийПланаПроизводства</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийПрогнозаСкладскогоОстатка</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтраховойЗапас</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Дней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкладскиеОстатки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланПродаж</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МодельСкладскогоОстатка</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрогнозСкладскогоОстатка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрогнозПродаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УровеньНеснижаемогоОстатка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланПроизводства</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_ПланСкладскогоОстатка/Forms/ФормаЗагрузки/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Загрузка = ПолучитьТаблицуПоДокументу();
			
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Оповестить("абс_ПланСкладскогоОстатка_ЗагрузкаИзEXCEL", Загрузка);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПоДокументу() Экспорт
	
	обОбъект = РеквизитФормыВЗначение("Объект");
	дНачалоПериодаПланирования = НачалоДня(обОбъект.НачалоПериода);
	дКонецПериодаПланирования = НачалоДня(обОбъект.КонецПериода);
	
	Макет = Документы.абс_ПланСкладскогоОстатка.ПолучитьМакет("ЗагрузкаEXCEL");
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	
	ОбластьШапкаКлиентНоменклатура 	= Макет.ПолучитьОбласть("Шапка|КлиентНоменклатура");
	ОбластьШапкаПериод 				= Макет.ПолучитьОбласть("Шапка|Период");
	ОбластьСтрокаКлиентНоменклатура = Макет.ПолучитьОбласть("Строка|КлиентНоменклатура");
	ОбластьСтрокаПериод			 	= Макет.ПолучитьОбласть("Строка|Период");
	
	//нарисуем шапку
	ТабДок.Вывести(ОбластьШапкаКлиентНоменклатура);
	
	ВремДень = дНачалоПериодаПланирования;
	
	Пока ВремДень <= дКонецПериодаПланирования Цикл
		ОбластьШапкаПериод.Параметры.Период = ВремДень;		
		ТабДок.Присоединить(ОбластьШапкаПериод);	
		ВремДень = ВремДень + 86400
	КонецЦикла;
	//
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ПланПроизводстваСоставПлана.Период, ДЕНЬ) КАК Период,
		|	ПланПроизводстваСоставПлана.Номенклатура КАК Номенклатура,
		|	ПланПроизводстваСоставПлана.Номенклатура.Артикул КАК Артикул,
		|	ПланПроизводстваСоставПлана.ПрогнозСкладскогоОстатка КАК Количество
		|ИЗ
		|	Документ.абс_ПланСкладскогоОстатка.МодельСкладскогоОстатка КАК ПланПроизводстваСоставПлана
		|ГДЕ
		|	ПланПроизводстваСоставПлана.Ссылка = &Ссылка
		|	И ПланПроизводстваСоставПлана.Номенклатура ССЫЛКА Справочник.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Номенклатура,
		|	Период ПЕРИОДАМИ(ДЕНЬ, &НачПериода, &КонПериода)";

	Запрос.УстановитьПараметр("Ссылка", обОбъект.Ссылка);
	Запрос.УстановитьПараметр("НачПериода", дНачалоПериодаПланирования);
	Запрос.УстановитьПараметр("КонПериода", дКонецПериодаПланирования);

	Результат = Запрос.Выполнить();

	ВыборкаКлиентНоменклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаКлиентНоменклатура.Следующий() Цикл
		
		ОбластьСтрокаКлиентНоменклатура.Параметры.Заполнить(ВыборкаКлиентНоменклатура);
	  	ТабДок.Вывести(ОбластьСтрокаКлиентНоменклатура);

		ВыборкаПериод = ВыборкаКлиентНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период", "ВСЕ");

		Пока ВыборкаПериод.Следующий() Цикл
			ОбластьСтрокаПериод.Параметры.Заполнить(ВыборкаПериод);
			ТабДок.Присоединить(ОбластьСтрокаПериод);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
